package cn.labzen.hikvision.jna.definition;

import lombok.AllArgsConstructor;
import lombok.Getter;

import java.util.EnumSet;
import java.util.Optional;

/**
 * 图片文件类型
 */
@Getter
@AllArgsConstructor
public enum PictureFileType implements HikvisionEnum {

  /**
   * 全部
   */
  BY_FF(0xff, "全部"),

  /**
   * 定时抓图
   */
  BY_0(0, "定时抓图"),
  /**
   * 移动侦测抓图
   */
  BY_1(1, "移动侦测抓图"),
  /**
   * 报警抓图
   */
  BY_2(2, "报警抓图"),
  /**
   * 报警|移动侦测抓图
   */
  BY_3(3, "报警|移动侦测抓图"),
  /**
   * 报警&移动侦测抓图
   */
  BY_4(4, "报警&移动侦测抓图"),
  /**
   * 手动抓图
   */
  BY_6(6, "手动抓图"),
  /**
   * 智能图片
   */
  BY_9(9, "智能图片"),
  /**
   * PIR报警(预览时截图)
   */
  BY_10(10, "PIR报警(预览时截图)"),
  /**
   * 无线报警
   */
  BY_11(11, "无线报警"),
  /**
   * 呼救报警
   */
  BY_12(12, "呼救报警"),
  /**
   * 人脸侦测
   */
  BY_0XD(0xd, "人脸侦测"),
  /**
   * 越界侦测
   */
  BY_0XE(0xe, "越界侦测"),
  /**
   * 区域入侵侦测
   */
  BY_0XF(0xf, "区域入侵侦测"),
  /**
   * 场景变更侦测
   */
  BY_0X10(0x10, "场景变更侦测"),
  /**
   * 设备本地回放时截图
   */
  BY_0X11(0x11, "设备本地回放时截图"),
  /**
   * 智能侦测
   */
  BY_0X12(0x12, "智能侦测"),
  /**
   * 进入区域侦测
   */
  BY_0X13(0x13, "进入区域侦测"),
  /**
   * 离开区域侦测
   */
  BY_0X14(0x14, "离开区域侦测"),
  /**
   * 徘徊侦测
   */
  BY_0X15(0x15, "徘徊侦测"),
  /**
   * 人员聚集侦测
   */
  BY_0X16(0x16, "人员聚集侦测"),
  /**
   * 快速运动侦测
   */
  BY_0X17(0x17, "快速运动侦测"),
  /**
   * 停车侦测
   */
  BY_0X18(0x18, "停车侦测"),
  /**
   * 物品遗留侦测
   */
  BY_0X19(0x19, "物品遗留侦测"),
  /**
   * 物品拿取侦测
   */
  BY_0X1A(0x1a, "物品拿取侦测"),
  /**
   * 车牌侦测
   */
  BY_0X1B(0x1b, "车牌侦测"),
  /**
   * 混行检测
   */
  BY_0X1C(0x1c, "混行检测"),
  /**
   * 取证事件
   */
  BY_0X1D(0x1d, "取证事件"),
  /**
   * 火点检测
   */
  BY_0X1E(0x1e, "火点检测"),
  /**
   * 船只检测
   */
  BY_0X20(0x20, "船只检测"),
  /**
   * 测温预警
   */
  BY_0X21(0x21, "测温预警"),
  /**
   * 测温报警
   */
  BY_0X22(0x22, "测温报警"),
  /**
   * 温差报警
   */
  BY_0X23(0x23, "温差报警"),
  /**
   * 违停检测
   */
  BY_0X24(0x24, "违停检测"),
  /**
   * 人脸抓拍
   */
  BY_0X25(0x25, "人脸抓拍"),
  /**
   * 离线测温报警
   */
  BY_0X26(0x26, "离线测温报警"),
  /**
   * 起身检测
   */
  BY_0X2A(0x2a, "起身检测"),
  /**
   * 折线攀高
   */
  BY_0X2B(0x2b, "折线攀高"),
  /**
   * 如厕超时
   */
  BY_0X2C(0x2c, "如厕超时"),
  /**
   * 安全帽检测
   */
  BY_0X2D(0x2d, "安全帽检测"),
  /**
   * 周界抓拍
   */
  BY_0X2E(0x2e, "周界抓拍"),
  /**
   * 人体目标抓拍
   */
  BY_0X2F(0x2f, "人体目标抓拍"),
  /**
   * 人脸抓拍建模
   */
  BY_0X30(0x30, "人脸抓拍建模"),
  /**
   * 混合目标检测
   */
  BY_0X31(0x31, "混合目标检测"),
  /**
   * 防区报警
   */
  BY_0X32(0x32, "防区报警"),
  /**
   * 紧急求助
   */
  BY_0X33(0x33, "紧急求助"),
  /**
   * 业务咨询
   */
  BY_0X34(0x34, "业务咨询"),
  /**
   * 非法摆摊
   */
  BY_0X35(0x35, "非法摆摊"),
  /**
   * 人员密度(人数预警)
   */
  BY_0X36(0x36, "人员密度(人数预警)"),
  /**
   * 离岗检测
   */
  BY_0X37(0x37, "离岗检测"),
  /**
   * 人数异常检测
   */
  BY_0X38(0x38, "人数异常检测"),
  /**
   * 剧烈运动检测
   */
  BY_0X39(0x39, "剧烈运动检测"),
  /**
   * 违停
   */
  BY_0X3A(0x3a, "违停"),
  /**
   * 逆行
   */
  BY_0X3B(0x3b, "逆行"),
  /**
   * 压线
   */
  BY_0X3C(0x3c, "压线"),
  /**
   * 机占非
   */
  BY_0X3D(0x3d, "机占非"),
  /**
   * 变道
   */
  BY_0X3E(0x3e, "变道"),
  /**
   * 掉头
   */
  BY_0X3F(0x3f, "掉头"),
  /**
   * 行人检测
   */
  BY_0X40(0x40, "行人检测"),
  /**
   * 路障
   */
  BY_0X41(0x41, "路障"),
  /**
   * 抛洒物
   */
  BY_0X42(0x42, "抛洒物"),
  /**
   * 浓雾检测
   */
  BY_0X43(0x43, "浓雾检测"),
  /**
   * 施工
   */
  BY_0X44(0x44, "施工"),
  /**
   * 拥堵
   */
  BY_0X45(0x45, "拥堵"),
  /**
   * 交通事故检测
   */
  BY_0X46(0x46, "交通事故检测"),
  /**
   * 侧方停车
   */
  BY_0X47(0x47, "侧方停车"),
  /**
   * 手动触发报警
   */
  BY_0X48(0x48, "手动触发报警");

  private int code;
  private String description;

  public static Optional<PictureFileType> byCode(int code) {
    return EnumSet.allOf(PictureFileType.class).stream().filter(in -> in.code == code).findFirst();
  }
}
